Catalogs/ШаблоныКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныКодовМаркировкиСУЗ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКодаМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКодовМаркировкиИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСерийногоНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныРазбораКодовМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонРазбораКодовМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРазбораКодовМаркировкиИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Импорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусыКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКлассификаторовВидовПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныКодовМаркировкиСУЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает шаблоны кодов маркировки СУЗ по товарным группам ГИС МТ и типам кодов маркировки.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ТоварныеГруппыГИСМТ - товарная группа.
//   * Значение - Соответствие из КлючИЗначение:
//      ** Ключ     - ПеречислениеСсылка.ТипыКодовМаркировкиИСМП - тип кода маркировки.
//      ** Значение - Соответствие из КлючИЗначение:
//          *** Ключ - СправочникСсылка.ШаблоныКодовМаркировкиСУЗ - шаблон кода маркировки.
//          *** Значение - Булево - Истина если шаблон используется по умолчанию.
//
Функция ШаблоныКодовМаркировки() Экспорт

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныКМ.Ссылка КАК Ссылка,
	|	ШаблоныКМ.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	ШаблоныКМ.ТипКодаМаркировки КАК ТипКодаМаркировки,
	|	ШаблоныКМ.ИспользоватьПоУмолчанию
	|ИЗ
	|	Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКМ
	|ГДЕ
	|	НЕ ШаблоныКМ.Архивный";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Результат[Выборка.ТоварнаяГруппа] = Неопределено Тогда
			Результат.Вставить(Выборка.ТоварнаяГруппа, Новый Соответствие);
		КонецЕсли;
		Если Результат[Выборка.ТоварнаяГруппа][Выборка.ТипКодаМаркировки] = Неопределено Тогда
			Результат[Выборка.ТоварнаяГруппа].Вставить(Выборка.ТипКодаМаркировки, Новый Соответствие);
		КонецЕсли;
		Результат[Выборка.ТоварнаяГруппа][Выборка.ТипКодаМаркировки].Вставить(Выборка.Ссылка, Выборка.ИспользоватьПоУмолчанию);
	КонецЦикла;

	Возврат Новый ФиксированноеСоответствие(Результат);

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Идентификатор");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт

	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ШаблоныКодовМаркировкиСУЗ.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьШаблоныРазбораКМСУЗИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьШаблоныРазбораКМСУЗИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)

	Идентификаторы      = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке     = ДанныеКлассификатора.ШаблоныКодовМаркировкиСУЗ;
	ИмяТаблицы          = Метаданные.Справочники.ШаблоныКодовМаркировкиСУЗ.ПолноеИмя();
	ИмяТаблицыТГ        = Метаданные.Справочники.ТоварныеГруппыГИСМТ.ПолноеИмя();
	КонфликтыОбновления = ПараметрыЗагрузки.КонфликтыОбновления;
	
	ИмяТаблицыШаблонов       = Метаданные.Справочники.ШаблоныРазбораКодовМаркировкиИСМП.ПолноеИмя();
	ТаблицаШаблоновРазбораКМ = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицыШаблонов),
		"Идентификатор, Наименование, Ссылка");

	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор",               ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеДляПодбора.Колонки.Добавить("Код",                         ОбщегоНазначения.ОписаниеТипаЧисло(4));
	ДанныеДляПодбора.Колонки.Добавить("ТоварнаяГруппа",              Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппыГИСМТ"));
	ДанныеДляПодбора.Колонки.Добавить("ТипШтрихкода",                Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	ДанныеДляПодбора.Колонки.Добавить("ТоварнаяГруппаНаименование",  ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("ТоварнаяГруппаИдентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеДляПодбора.Колонки.Добавить("ТипКодаМаркировки",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКодовМаркировкиИСМП"));

    ИдентификаторыШаблонов = ДанныеДляПодбора.Скопировать();

	Для Каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
		СтруктураПоискаТГ = Новый Структура;
		СтруктураПоискаТГ.Вставить("ИмяТаблицы",    ИмяТаблицыТГ);
		СтруктураПоискаТГ.Вставить("Наименование",  СтрокаКЗагрузке.ТоварнаяГруппаНаименование);
		СтруктураПоискаТГ.Вставить("Идентификатор", СтрокаКЗагрузке.ТоварнаяГруппаИдентификатор);
		
		НайденныеТоварныеГруппы = Идентификаторы.НайтиСтроки(СтруктураПоискаТГ);
		Если НайденныеТоварныеГруппы.Количество() Тогда
			ТоварнаяГруппа = НайденныеТоварныеГруппы[0].Ссылка;
		Иначе
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Метаданные.Перечисления.ТипыКодовМаркировкиИСМП.ЗначенияПеречисления.Найти(
			СтрокаКЗагрузке.ТипКодаМаркировки) <> Неопределено Тогда
			ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП[СтрокаКЗагрузке.ТипКодаМаркировки];
		Иначе
			Если ПараметрыЗагрузки.РежимОтладки Тогда
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска типа кода маркировки ИСМП'");
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Метаданные.Перечисления.ТипыШтрихкодов.ЗначенияПеречисления.Найти(
			СтрокаКЗагрузке.ТипШтрихкода) <> Неопределено Тогда
			ТипШтрихкода = Перечисления.ТипыШтрихкодов[СтрокаКЗагрузке.ТипШтрихкода];
		Иначе
			Если ПараметрыЗагрузки.РежимОтладки Тогда
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска типа штрихкода'");
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаДанныхДляПодбора = ДанныеДляПодбора.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДанныхДляПодбора, СтрокаКЗагрузке);
		
		СтрокаДанныхДляПодбора.ТоварнаяГруппа    = ТоварнаяГруппа;
		СтрокаДанныхДляПодбора.ТипКодаМаркировки = ТипКодаМаркировки;
		СтрокаДанныхДляПодбора.ТипШтрихкода      = ТипШтрихкода;
		
	КонецЦикла;
  
    ИдентификаторыШаблонов.Колонки.Добавить("СуществующийОбъектСсылка",   Неопределено);
	ИдентификаторыШаблонов.Колонки.Добавить("ТипКодаМаркировкиСтрокой",   ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ИдентификаторыШаблонов.Колонки.Добавить("ТипШтрихкодаСтрокой",        ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ИдентификаторыШаблонов.Колонки.Добавить("ХешСумма",                   ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ИдентификаторыШаблонов.Колонки.Добавить("ХешСуммаПоставляемыхДанных", ОбщегоНазначения.ОписаниеТипаСтрока(50));
    
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ДанныеДляПодбора.ТоварнаяГруппа КАК ТоварнаяГруппа,
		|	ДанныеДляПодбора.ТипКодаМаркировки КАК ТипКодаМаркировки,
		|	ДанныеДляПодбора.ТипШтрихкода КАК ТипШтрихкода,
		|	ДанныеДляПодбора.ТоварнаяГруппаНаименование КАК ТоварнаяГруппаНаименование,
		|	ДанныеДляПодбора.ТоварнаяГруппаИдентификатор КАК ТоварнаяГруппаИдентификатор,
		|	ДанныеДляПодбора.Код КАК Код
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.ТоварнаяГруппа КАК ТоварнаяГруппа,
		|	втДанныеДляПодбора.ТипКодаМаркировки КАК ТипКодаМаркировки,
		|	втДанныеДляПодбора.ТипШтрихкода КАК ТипШтрихкода,
		|	ШаблоныКодовМаркировкиСУЗ.Ссылка КАК СсылкаПоИдентификатору,
		|	втДанныеДляПодбора.ТоварнаяГруппаНаименование КАК ТоварнаяГруппаНаименование,
		|	втДанныеДляПодбора.ТоварнаяГруппаИдентификатор КАК ТоварнаяГруппаИдентификатор,
		|	ШаблоныКодовМаркировкиСУЗ.ХешСумма КАК ХешСумма,
		|	ШаблоныКодовМаркировкиСУЗ.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировкиСУЗ
		|		ПО (ШаблоныКодовМаркировкиСУЗ.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.ТипКодаМаркировки КАК ТипКодаМаркировки,
		|	втДанныеДляПодбора.ТипШтрихкода КАК ТипШтрихкода,
		|	ШаблоныКодовМаркировкиСУЗ.Ссылка КАК СсылкаПоКлючевымПолям,
		|	ШаблоныКодовМаркировкиСУЗ.ХешСумма КАК ХешСумма,
		|	ШаблоныКодовМаркировкиСУЗ.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных,
		|	втДанныеДляПодбора.ТоварнаяГруппаНаименование КАК ТоварнаяГруппаНаименование,
		|	втДанныеДляПодбора.ТоварнаяГруппаИдентификатор КАК ТоварнаяГруппаИдентификатор,
		|	втДанныеДляПодбора.ТоварнаяГруппа КАК ТоварнаяГруппа
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировкиСУЗ
		|		ПО втДанныеДляПодбора.ТоварнаяГруппа = ШаблоныКодовМаркировкиСУЗ.ТоварнаяГруппа
		|			И втДанныеДляПодбора.ТипКодаМаркировки = ШаблоныКодовМаркировкиСУЗ.ТипКодаМаркировки
		|			И втДанныеДляПодбора.ТипШтрихкода = ШаблоныКодовМаркировкиСУЗ.ТипШтрихкода
		|			И втДанныеДляПодбора.Код = ШаблоныКодовМаркировкиСУЗ.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	втРезультатыПодбораПоКлючевымПолям.Код КАК Код,
		|	втРезультатыПодбораПоКлючевымПолям.ТипКодаМаркировки КАК ТипКодаМаркировки,
		|	втРезультатыПодбораПоКлючевымПолям.ТипШтрихкода КАК ТипШтрихкода,
		|	втРезультатыПодбораПоКлючевымПолям.ТоварнаяГруппа КАК ТоварнаяГруппа,
		|	втРезультатыПодбораПоКлючевымПолям.ТоварнаяГруппаИдентификатор КАК ТоварнаяГруппаИдентификатор,
		|	втРезультатыПодбораПоКлючевымПолям.ТоварнаяГруппаНаименование КАК ТоварнаяГруппаНаименование,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|			И втРезультатыПодбораПоКлючевымПолям.ТоварнаяГруппа = втРезультатыПодбораПоИдентификатору.ТоварнаяГруппа
		|			И втРезультатыПодбораПоКлючевымПолям.ТипКодаМаркировки = втРезультатыПодбораПоИдентификатору.ТипКодаМаркировки
		|			И втРезультатыПодбораПоКлючевымПолям.ТипШтрихкода = втРезультатыПодбораПоИдентификатору.ТипШтрихкода
		|			И втРезультатыПодбораПоКлючевымПолям.Код = втРезультатыПодбораПоИдентификатору.Код";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаИдентификатора = ИдентификаторыШаблонов.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
		
		СтрокаИдентификатора.ТипКодаМаркировкиСтрокой = ОбщегоНазначения.ИмяЗначенияПеречисления(ВыборкаДетальныеЗаписи.ТипКодаМаркировки);
		СтрокаИдентификатора.ТипШтрихкодаСтрокой      = ОбщегоНазначения.ИмяЗначенияПеречисления(ВыборкаДетальныеЗаписи.ТипШтрихкода);
				
	КонецЦикла;

	Для Каждого СтрокаДанных Из ДанныеКЗагрузке Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Идентификатор", СтрокаДанных.Идентификатор);
		СтруктураПоиска.Вставить("ТоварнаяГруппаНаименование", СтрокаДанных.ТоварнаяГруппаНаименование);
		СтруктураПоиска.Вставить("ТоварнаяГруппаИдентификатор", СтрокаДанных.ТоварнаяГруппаИдентификатор);
		СтруктураПоиска.Вставить("ТипКодаМаркировкиСтрокой", СтрокаДанных.ТипКодаМаркировки);
		СтруктураПоиска.Вставить("ТипШтрихкодаСтрокой", СтрокаДанных.ТипШтрихкода);
		СтруктураПоиска.Вставить("Код", СтрокаДанных.Код);

		НайденныеСтроки = ИдентификаторыШаблонов.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			СтрокаПодобранныхДанных = НайденныеСтроки[0];
		Иначе
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаПодобранныхДанных.ТоварнаяГруппа) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = СтрокаДанных.Идентификатор;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И СтрокаДанных.Свойство("Модифицирован") Тогда
			Если Не СтрокаДанных.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка       = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
				СтрокаИдентификатора.КлючЗначения = КлючЗначенияПриОбновленииИзКлассификатора(
					СтрокаПодобранныхДанных.СуществующийОбъектСсылка);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаПодобранныхДанных.ХешСумма,
			СтрокаПодобранныхДанных.ХешСуммаПоставляемыхДанных, СтрокаДанных.ХешСуммаПоставляемыхДанных);
			
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, СтрокаДанных.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;

		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = СтрокаПодобранныхДанных.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СоставЗначения = Новый СписокЗначений;
			СоставЗначения.Добавить(СтрокаПодобранныхДанных.ТоварнаяГруппа);
			СоставЗначения.Добавить(СтрокаПодобранныхДанных.ТипКодаМаркировки);
			СоставЗначения.Добавить(СтрокаПодобранныхДанных.ТипШтрихкода);
			СоставЗначения.Добавить(СтрокаПодобранныхДанных.Код);
			СоставЗначения.Добавить(СтрокаПодобранныхДанных.Идентификатор);
			
			СоставЗначения.СортироватьПоЗначению();
			
			СтрокаИдентификатора.Ссылка       = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
			СтрокаИдентификатора.КлючЗначения = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(СоставЗначения.ВыгрузитьЗначения()));
			
		КонецЕсли;

		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаДанных);
		КонецЕсли;

		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, СтрокаДанных, ,
				"ТипКодаМаркировки, ТипШтрихкода, Идентификатор, ХешСуммаПоставляемыхДанных");
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, СтрокаПодобранныхДанных,
				"ТипКодаМаркировки, ТипШтрихкода, ТоварнаяГруппа");

			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = СтрокаДанных.Идентификатор;
			КонецЕсли;

			Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				СтрокаДанных.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[СтрокаДанных.Статус];
			КонецЕсли;

			СуществующийОбъект.ХешСумма = СтрокаДанных.ХешСуммаПоставляемыхДанных;

			Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
				СуществующийОбъект.ХешСуммаПоставляемыхДанных = СтрокаДанных.ХешСуммаПоставляемыхДанных;
			КонецЕсли;

			СуществующийОбъект.ШаблоныРазбораКодовМаркировки.Очистить();

			Для Каждого ШаблонРазбораКМ Из СтрокаДанных.ШаблоныРазбораКодовМаркировки Цикл
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Идентификатор", ШаблонРазбораКМ.Идентификатор);
				СтруктураПоиска.Вставить("Наименование", ШаблонРазбораКМ.ШаблонРазбора);
				НайденныеСтрокиШаблонов = ТаблицаШаблоновРазбораКМ.НайтиСтроки(СтруктураПоиска);

				Если НайденныеСтрокиШаблонов.Количество() Тогда
					СтрокаШаблонаРазбораКМ = СуществующийОбъект.ШаблоныРазбораКодовМаркировки.Вставить(ШаблонРазбораКМ.НомерСтроки-1);
					СтрокаШаблонаРазбораКМ.ШаблонРазбораКодовМаркировки = НайденныеСтрокиШаблонов[0].Ссылка;
					СтрокаШаблонаРазбораКМ.Импорт = ШаблонРазбораКМ.Импорт;
				Иначе
					Если ПараметрыЗагрузки.РежимОтладки Тогда
						ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска шаблона разборка кодов маркировки'");
					Иначе
						РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);

			СтрокаИдентификатора.Ссылка       = СуществующийОбъект.Ссылка;
			СтрокаИдентификатора.КлючЗначения = КлючЗначенияПриОбновленииИзКлассификатора(СуществующийОбъект.Ссылка);

		КонецЕсли;

	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
		|	ШаблоныКодовМаркировкиСУЗ.Идентификатор КАК Идентификатор,
		|	ШаблоныКодовМаркировкиСУЗ.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировкиСУЗ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицы);
			СтруктураПоиска.Вставить("Идентификатор", ВыборкаДетальныеЗаписи.Идентификатор);
			СтруктураПоиска.Вставить("КлючЗначения",  КлючЗначенияПриОбновленииИзКлассификатора(ВыборкаДетальныеЗаписи.Ссылка));
			
			НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);
			
			Если Не НайденныеСтроки.Количество() Тогда
				СтрокаИдентификатора = Идентификаторы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, СтруктураПоиска);
				
				СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",                  "");
	СтруктураДанныхОбновления.Вставить("Код",                           0);
	СтруктураДанныхОбновления.Вставить("Идентификатор",                 "");
	СтруктураДанныхОбновления.Вставить("ТоварнаяГруппаИдентификатор",   "");
	СтруктураДанныхОбновления.Вставить("ТоварнаяГруппаНаименование",    "");
	СтруктураДанныхОбновления.Вставить("ТипКодаМаркировки",             "");
	СтруктураДанныхОбновления.Вставить("ТипШтрихкода",                  "");
	СтруктураДанныхОбновления.Вставить("ДлинаСерийногоНомера",          0);
	СтруктураДанныхОбновления.Вставить("Архивный",                      Ложь);
	СтруктураДанныхОбновления.Вставить("Статус",                        "");
	СтруктураДанныхОбновления.Вставить("ИспользоватьПоУмолчанию",       Ложь);
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных",    "");
	СтруктураДанныхОбновления.Вставить("ШаблоныРазбораКодовМаркировки", Новый Массив);	

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

Функция КлючЗначенияПриОбновленииИзКлассификатора(ШаблонСУЗ) Экспорт
	
	СоставЗначения             = Новый СписокЗначений;
	ТребуемыеРеквизитыЗначения = "ТоварнаяГруппа, ТипКодаМаркировки, ТипШтрихкода, Код, Идентификатор";
	РеквизитыЗначения          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШаблонСУЗ, ТребуемыеРеквизитыЗначения);
	Для Каждого РеквизитЗначения Из РеквизитыЗначения Цикл
		СоставЗначения.Добавить(РеквизитЗначения.Значение);
	КонецЦикла;
	СоставЗначения.СортироватьПоЗначению();
	
	СтрокаДляРасчетаХеша = СтрСоединить(СоставЗначения.ВыгрузитьЗначения());
	
	Возврат ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
	
КонецФункции

#КонецОбласти

#КонецЕсли
